{
  "profile": "tabular-data-package",
  "resources": [
    {
      "name": "A short url-usable (and preferably human-readable) name of the resource",
      "path": "property describing the location of the data associated to the resource, located online or locally on disk",
      "profile": "tabular-data-resource",
      "schema": {
        "fields": [
          {
            "name": "field1",
            "type": "string",
            "format": "default",
            "title": "Column1",
            "description": "Meaning and details"
          },
          {
            "name": "field2",
            "type": "number",
            "format": "default",
            "title": "Column2",
            "description": "Meaning and details"
          },
          {
            "name": "field3",
            "type": "integer",
            "format": "default",
            "title": "Column3",
            "description": "Meaning and details"
          },
          {
            "name": "field4",
            "type": "date",
            "format": "default",
            "title": "Column4",
            "description": "Meaning and details"
          },
          {
            "name": "field5",
            "type": "boolean",
            "format": "default",
            "title": "Column5",
            "description": "Meaning and details"
          }
        ]
      },
      "title": "A string providing a title or one sentence description for this resource",
      "format": "‘csv’, ‘xls’, ‘json’ etc. Would be expected to be the standard file extension for this type of resource",
      "encoding": "specify the character encoding of the resource’s data file. If no value for this key is specified then the default is UTF-8",
      "description": "A description of the resource. The description MUST be markdown formatted"
    }
  ],
  "keywords": [
    "An Array of string keywords to assist users searching for the package in catalogs"
  ],
  "homepage": "A URL for the home on the web that is related to this data package",
  "version": "A version string identifying the version of the package. It should conform to the Semantic Versioning requirements and should follow the Data Package Version pattern",
  "licenses": [
    {
      "name": "CC-BY-4.0",
      "title": "Creative Commons Attribution 4.0",
      "path": "https://creativecommons.org/licenses/by/4.0/"
    }
  ],
  "name": "A short url-usable (and preferably human-readable) name of the package. This MUST be lower-case and contain only alphanumeric characters along with “.”, “_” or “-” characters. It will function as a unique identifier and therefore SHOULD be unique in relation to any registry in which this package will be deposited (and preferably globally unique)",
  "title": "A string providing a title or one sentence description for this package",
  "description": "A description of the package. The description MUST be markdown formatted",
  "contributors": [
    {
      "title": "name for person, name/title of organization",
      "role": "author"
    }
  ]
}